coocox/Mplib/Toshaba/TMPM37x/TMPM373/cmsis_lib/lib/inc/tmpm373_gpio.h
#define IS_GPIO_PULLDOWN(param)         (((param) == GPIO_PA)|| \
                                         ((param) == GPIO_PB)|| \
                                         ((param) == GPIO_PD)|| \
                                         ((param) == GPIO_PE)|| \
                                         ((param) == GPIO_PF)|| \
                                         ((param) == GPIO_PG)|| \
                                         ((param) == GPIO_PI)|| \
                                         ((param) == GPIO_PJ)|| \
                                         ((param) == GPIO_PK)|| \
                                         ((param) == GPIO_PM))

#define IS_GPIO_OPEN_DRAIN(param)       (((param) == GPIO_PA)|| \
                                         ((param) == GPIO_PB)|| \
                                         ((param) == GPIO_PD)|| \
                                         ((param) == GPIO_PE)|| \
                                         ((param) == GPIO_PF)|| \
                                         ((param) == GPIO_PG)|| \
                                         ((param) == GPIO_PI)|| \
                                         ((param) == GPIO_PJ)|| \
                                         ((param) == GPIO_PK)|| \
                                         ((param) == GPIO_PM))

#define IS_GPIO_FUNCTION(param)         (((param) == GPIO_PA)|| \
                                         ((param) == GPIO_PB)|| \
                                         ((param) == GPIO_PD)|| \
                                         ((param) == GPIO_PE)|| \
                                         ((param) == GPIO_PF)|| \
                                         ((param) == GPIO_PG)|| \
                                         ((param) == GPIO_PJ)|| \
                                         ((param) == GPIO_PK))

#define IS_GPIO_PA_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PB_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PD_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PE_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PF_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PG_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PJ_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PK_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))
/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0x74)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0x74)
#define GPIO_PA_PULLDOWN_BIT_ALL                 ((uint8_t)0x74)
#define GPIO_PA_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x74)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0x74)
#define GPIO_PA_FR1_BIT_ALL                      ((uint8_t)0x74)
#define GPIO_PA_FR2_BIT_ALL                      ((uint8_t)0x74)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0x78)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0x78)
#define GPIO_PB_PULLDOWN_BIT_ALL                 ((uint8_t)0x78)
#define GPIO_PB_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x78)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0x78)
#define GPIO_PB_FR1_BIT_ALL                      ((uint8_t)0x78)

#define GPIO_PD_OUTPUT_BIT_ALL                   ((uint8_t)0x40)
#define GPIO_PD_PULLUP_BIT_ALL                   ((uint8_t)0x40)
#define GPIO_PD_PULLDOWN_BIT_ALL                 ((uint8_t)0x40)
#define GPIO_PD_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x40)
#define GPIO_PD_INPUT_BIT_ALL                    ((uint8_t)0x40)
#define GPIO_PD_FR1_BIT_ALL                      ((uint8_t)0x40)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xD7)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xD7)
#define GPIO_PE_PULLDOWN_BIT_ALL                 ((uint8_t)0xD7)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xD7)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xD7)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0xD7)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xD4)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PF_PULLDOWN_BIT_ALL                 ((uint8_t)0x1F)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x1F)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0x1F)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0x1F)
#define GPIO_PF_FR2_BIT_ALL                      ((uint8_t)0x1C)
#define GPIO_PF_FR3_BIT_ALL                      ((uint8_t)0x04)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLDOWN_BIT_ALL                 ((uint8_t)0xFF)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PG_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0x08)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0x08)
#define GPIO_PI_PULLDOWN_BIT_ALL                 ((uint8_t)0x08)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x08)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0x08)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0xE1)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xE1)
#define GPIO_PJ_PULLDOWN_BIT_ALL                 ((uint8_t)0xE1)
#define GPIO_PJ_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xE1)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xE1)
#define GPIO_PJ_FR1_BIT_ALL                      ((uint8_t)0xC0)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PK_PULLDOWN_BIT_ALL                 ((uint8_t)0x03)
#define GPIO_PK_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x03)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0x03)
#define GPIO_PK_FR1_BIT_ALL                      ((uint8_t)0x03)

#define GPIO_PM_OUTPUT_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PM_PULLUP_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PM_PULLDOWN_BIT_ALL                 ((uint8_t)0x03)
#define GPIO_PM_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x03)
#define GPIO_PM_INPUT_BIT_ALL                    ((uint8_t)0x03)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6))

#define IS_GPIO_PD_DATA_BIT(param)      (((param) == GPIO_BIT_6))

#define IS_GPIO_PE_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PF_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4))

